jelli123/LPC1115_Emulator/src/fault.cpp
#include "fault.h"
#include "opcodes.h"
#include "peripherals.h"
#include "gdb_stub.h"
#include "iap.h"
#include "emulator.h"
#include "config.h"
#include "vnvic.h"

#include <cstdio>
#include <cstdint>
#include <cstring>
#include <cstdarg>
#include <atomic>
#include "hardware/watchdog.h"
#include "pico/stdlib.h"
#include "RP2350.h"

namespace faultsys {

namespace {
Stats g_stats{};

// --- Fault-Report-Puffer (Core1 schreibt, Core0 liest) --------------------
// Aufgebaut aus denselben Zeilen wie die serielle [FAULT]-Diagnose (femit
// spiegelt jeden printf hier hinein). Ein einzelner fataler Fault passt locker
// in 2 KiB. g_report_ready wird mit release gesetzt, nachdem der Puffer fertig
// ist; Core0 liest mit acquire.
char                 g_report[2048];
uint32_t             g_report_len = 0;
std::atomic<bool>    g_report_ready{false};

void report_reset() {
    g_report_len = 0;
    g_report[0]  = '\0';
    g_report_ready.store(false, std::memory_order_relaxed);
}

void report_puts(const char* s) {
    while (*s && g_report_len + 1u < sizeof g_report) g_report[g_report_len++] = *s++;
    g_report[g_report_len] = '\0';
}

void report_commit() { g_report_ready.store(true, std::memory_order_release); }
} // namespace

Stats stats() { return g_stats; }

void init() { g_stats = {}; }

bool        report_ready()  { return g_report_ready.load(std::memory_order_acquire); }
const char* report_data()   { return g_report; }
uint32_t    report_length() { return g_report_len; }
void        clear_report()  { g_report_ready.store(false, std::memory_order_release); }

} // namespace faultsys

namespace {

// Bildet eine Gast-Adresse (LPC-Sicht 0x0000.. / 0x1000.. ODER bereits auf
// das RP2350-SRAM relozierte Adresse) auf einen lesbaren Host-Pointer ab und
// liest 4 Bytes. Liefert false, wenn die Adresse in keinem gemappten Bereich
// liegt (dann kein Zugriff -> handler-safe, auch fuer Muelladressen).
bool guest_read32_safe(uint32_t addr, uint32_t& out) {
    const uint32_t lb = emulator::load_base();
    const uint32_t rb = emulator::guest_ram_base();
    uint32_t host;
    if (addr < emulator::LPC_LOAD_MAX_SIZE) {
        host = lb + addr;                                   // LPC-Flash [0,64K)
    } else if (addr >= 0x1000'0000u &&
               addr <  0x1000'0000u + emulator::LPC_GUEST_RAM_SIZE) {
        host = rb + (addr - 0x1000'0000u);                  // LPC-SRAM
    } else if (addr >= lb && addr < lb + emulator::LPC_LOAD_MAX_SIZE) {
        host = addr;                                        // reloziertes Flash
    } else if (addr >= rb && addr < rb + emulator::LPC_GUEST_RAM_SIZE) {
        host = addr;                                        // reloziertes SRAM
    } else {
        return false;
    }
    std::memcpy(&out, reinterpret_cast<const void*>(host), 4);
    return true;
}

// Dual-Sink: gibt eine Zeile seriell aus UND haengt sie an den Fault-Report an
// (fuer FAULT.TXT auf dem USB-MSC). Wird von der gesamten [FAULT]-Diagnose
// genutzt. Bei nicht-fatalen Traps NICHT verwendet (kein Report noetig).
__attribute__((format(printf, 1, 2)))
void femit(const char* fmt, ...) {
    char line[192];
    va_list ap;
    va_start(ap, fmt);
    int n = std::vsnprintf(line, sizeof line, fmt, ap);
    va_end(ap);
    if (n < 0) return;
    std::fputs(line, stdout);
    faultsys::report_puts(line);
}

// Rueckkehr eines injizierten LPC-IRQ-Handlers. Die IRQ-Injektion
// (irq_inject.cpp) legt einen synthetischen Exception-Frame auf den Gast-PSP,
// sodass der LPC-Handler nach dem PendSV-EXC_RETURN im THREAD-Mode mit
// LR=0xFFFFFFFD anlaeuft. Beendet sich der Handler regulaer (POP {..,pc} bzw.
// BX LR mit eben diesem 0xFFFFFFFD), laedt er PC=0xFFFFFFFD — im Thread-Mode ist
// das KEINE gueltige Exception-Rueckkehr: der Core versucht 0xFFFFFFFC
// anzuspringen und faultet (BusFault; unter PRIMASK zu HardFault eskaliert).
// Der vom IRQ unterbrochene Original-Gast-Frame liegt genau 32 Byte OBERHALB des
// Fault-Frames auf dem PSP (der Handler hat seinen eigenen Stack balanciert).
// Wir heben den PSP um diese 32 Byte an; die anschliessende HW-Exception-
// Rueckkehr unseres Fault-Handlers pop't dann jenen Original-Frame und setzt den
// unterbrochenen Gast-Code transparent fort (HW behandelt ein evtl. Alignment-
// Padding des Original-Frames selbst via xPSR-Bit 9).
//
// Ohne diese Behandlung wuerde JEDER injizierte IRQ beim Ruecksprung faulten
// (betrifft alle Firmware mit Interrupts, z. B. KNX-Timer/Bus-IRQs).
// Signatur: PC im EXC_RETURN-Bereich (>=0xFFFFFFE0) UND Fault aus Thread-Mode
// (Frame liegt auf PSP) UND der Original-Frame ist plausibel (xPSR.T gesetzt).
bool try_injected_irq_return(uint32_t* frame) {
    if ((frame[6] & 0xFFFF'FFE0u) != 0xFFFF'FFE0u) return false;  // PC != EXC_RETURN
    uint32_t psp;
    __asm volatile ("mrs %0, psp" : "=r"(psp));
    if (reinterpret_cast<uint32_t>(frame) != psp) return false;   // nicht Thread/PSP
    const uint32_t* orig = frame + 8;                             // Frame 32 B darueber
    if (!(orig[7] & (1u << 24))) return false;                    // xPSR.T plausibel?
    psp += 32u;                                                   // Fault-Frame ueberspringen
    __asm volatile ("msr psp, %0" :: "r"(psp));
    __ISB();
    ++faultsys::g_stats.mem_traps;
    return true;
}

// Dekodiert die wichtigsten CFSR/HFSR-Bits (ARMv8-M) in Klartext.
void print_fault_cause() {
    const uint32_t c = SCB->CFSR;
    const uint32_t h = SCB->HFSR;
    // MemManage (MMFSR, Bits 0-7)
    if (c & (1u<<0))  femit("[FAULT]  MMFSR.IACCVIOL  (Code-Fetch verboten)\n");
    if (c & (1u<<1))  femit("[FAULT]  MMFSR.DACCVIOL  (Daten-Zugriff verboten)\n");
    if (c & (1u<<3))  femit("[FAULT]  MMFSR.MUNSTKERR (Unstacking-Fehler)\n");
    if (c & (1u<<4))  femit("[FAULT]  MMFSR.MSTKERR   (Stacking-Fehler)\n");
    if (c & (1u<<5))  femit("[FAULT]  MMFSR.MLSPERR   (Lazy-FP-Stacking)\n");
    // BusFault (BFSR, Bits 8-15)
    if (c & (1u<<8))  femit("[FAULT]  BFSR.IBUSERR    (Instruktions-Bus)\n");
    if (c & (1u<<9))  femit("[FAULT]  BFSR.PRECISERR  (praeziser Daten-Bus)\n");
    if (c & (1u<<10)) femit("[FAULT]  BFSR.IMPRECISERR(impraeziser Daten-Bus)\n");
    if (c & (1u<<11)) femit("[FAULT]  BFSR.UNSTKERR\n");
    if (c & (1u<<12)) femit("[FAULT]  BFSR.STKERR\n");
    // UsageFault (UFSR, Bits 16-25)
    if (c & (1u<<16)) femit("[FAULT]  UFSR.UNDEFINSTR (illegale Instruktion)\n");
    if (c & (1u<<17)) femit("[FAULT]  UFSR.INVSTATE   (ungueltiger Thumb/EPSR-State)\n");
    if (c & (1u<<18)) femit("[FAULT]  UFSR.INVPC      (ungueltiger EXC_RETURN/PC)\n");
    if (c & (1u<<19)) femit("[FAULT]  UFSR.NOCP       (Coprozessor/FPU nicht da)\n");
    if (c & (1u<<20)) femit("[FAULT]  UFSR.STKOF      (Stack-Overflow)\n");
    if (c & (1u<<24)) femit("[FAULT]  UFSR.UNALIGNED  (unaligned Zugriff)\n");
    if (c & (1u<<25)) femit("[FAULT]  UFSR.DIVBYZERO  (Division durch 0)\n");
    if (h & (1u<<30)) femit("[FAULT]  HFSR.FORCED     (eskalierter Fault)\n");
    if (h & (1u<<1))  femit("[FAULT]  HFSR.VECTTBL    (Vektortabellen-Lesefehler)\n");
}

// Gemeinsame Diagnose-Ausgabe fuer die fatalen Exception-Handler. f = Standard-
// exception-stacked Frame (r0,r1,r2,r3,r12,lr,pc,xpsr). r4_r11 optional (vom
// Asm-Wrapper gepushter Block) — nullptr, wenn nicht verfuegbar.
void print_exc_diag(const char* tag, const uint32_t* f, const uint32_t* r4_r11) {
    faultsys::report_reset();       // frischer Report fuer diese Fault-Sequenz
    const uint32_t lb = emulator::load_base();
    auto lpc = [&](uint32_t a) -> long {            // Host->LPC-Offset, sonst -1
        return (a >= lb && a < lb + emulator::LPC_LOAD_MAX_SIZE)
                   ? static_cast<long>(a - lb) : -1L;
    };
    femit("[FAULT] %s @PC=0x%08lx (LPC 0x%lx) CFSR=0x%08lx HFSR=0x%08lx\n",
                tag, (unsigned long)f[6], lpc(f[6] & ~1u),
                (unsigned long)SCB->CFSR, (unsigned long)SCB->HFSR);
    print_fault_cause();
    femit("[FAULT]  r0=%08lx r1=%08lx r2=%08lx r3=%08lx r12=%08lx\n",
                (unsigned long)f[0], (unsigned long)f[1], (unsigned long)f[2],
                (unsigned long)f[3], (unsigned long)f[4]);
    femit("[FAULT]  LR=%08lx (LPC 0x%lx)  xPSR=%08lx  SP=%08lx\n",
                (unsigned long)f[5], lpc(f[5] & ~1u), (unsigned long)f[7],
                (unsigned long)(reinterpret_cast<uint32_t>(f) + 0x20u));
    if (r4_r11)
        femit("[FAULT]  r4=%08lx r5=%08lx r6=%08lx r7=%08lx\n",
                    (unsigned long)r4_r11[0], (unsigned long)r4_r11[1],
                    (unsigned long)r4_r11[2], (unsigned long)r4_r11[3]);
    // Gefehlerte Instruktion(en) am PC, wenn die Adresse gemappt ist.
    uint32_t iw = 0;
    if (guest_read32_safe(f[6] & ~1u, iw))
        femit("[FAULT]  instr@PC = 0x%04lx 0x%04lx\n",
                    (unsigned long)(iw & 0xFFFFu), (unsigned long)(iw >> 16));
    // Fault-Adressen, falls gueltig (MMARVALID=Bit7, BFARVALID=Bit15 in CFSR).
    if (SCB->CFSR & (1u<<7))
        femit("[FAULT]  MMFAR=0x%08lx\n", (unsigned long)SCB->MMFAR);
    if (SCB->CFSR & (1u<<15))
        femit("[FAULT]  BFAR=0x%08lx\n", (unsigned long)SCB->BFAR);
}

