jelli123/LPC1115_Emulator/src/fault.cpp
    // Bootloader->App-Handover: SP-Korrektur anwenden, falls der soeben
    // emulierte SYSMEMREMAP-Store den Uebergang ausgeloest hat. Der Bootloader
    // fuehrt als naechste Instruktion `mov SP, StackTop` aus; wir ersetzen den
    // rohen LPC-RAM-StackTop im gestackten r4..r11-Block durch die relocierte
    // Gast-RAM-Adresse, damit der SP auf gueltiges RP2350-SRAM zeigt.
    {
        uint32_t sp_raw = 0, sp_reloc = 0;
        if (emulator::take_handover_sp_fixup(sp_raw, sp_reloc)) {
            for (int i = 0; i < 8; ++i) {
                if (r4_r11[i] == sp_raw) r4_r11[i] = sp_reloc;
            }
        }
    }

    // PC vorrücken
    frame->pc += acc.instr_size;
    // Sticky-Bits clearen (CFSR write-1-to-clear)
    SCB->CFSR = SCB->CFSR;
}

// --- Naked Exception-Handler ---------------------------------------------
// Der Pico-SDK-Linker erwartet die ISR-Symbole `isr_*`. Wir registrieren
// MemManage und BusFault. UsageFault (z. B. UDF, illegal opcode) und
// HardFault behandeln wir als echten Fault → Watchdog-Reset.

extern "C" __attribute__((naked)) void isr_busfault() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"   // 8-Byte-Alignment
        "add   r1, sp, #4          \n"   // r1 = &{r4..r11, lr_excret}
        "bl    handle_memfault_c   \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

extern "C" __attribute__((naked)) void isr_memmanage() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"
        "add   r1, sp, #4          \n"
        "bl    handle_memfault_c   \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

// HardFault. Sonderfall WFI-Pin-Wakeup (opt-in): Führt der Gast `WFI` mit
// gesperrten Interrupts aus (`PRIMASK=1`, das gängige
// "__disable_irq(); __WFI();"-Idiom), so kann der aus dem Patch entstandene
// `SVC #0` die SVCall-Exception nicht aktivieren (Priorität maskiert) und
// eskaliert zu HardFault (HFSR.FORCED=1). Wir erkennen das an der
// gefehlerten Instruktion (`0xDF00`) und behandeln es wie WFI: pollen echte
// Pin-Flanken/Timer, setzen bei fälligem IRQ PendSV (bleibt unter PRIMASK
// pending und feuert, sobald der Gast die Interrupts wieder freigibt) und
// kehren hinter das WFI zurück. PRIMASK des Gastes bleibt unangetastet.
extern "C" void hardfault_c(uint32_t* exc_frame, uint32_t* r4_r11) {
    // Rueckkehr eines injizierten LPC-IRQ-Handlers, der unter PRIMASK lief und
    // dessen 0xFFFFFFFD-Ruecksprung daher zu HardFault eskalierte. Zuerst
    // pruefen (vor jeder PC-Dereferenzierung wie dem WFI-Check unten).
    if (try_injected_irq_return(exc_frame)) return;

    // Eskalierte IACCVIOL: Der Gast sprang ueber einen NICHT-relozierten
    // LPC-Funktionspointer (rohe Flash-Adresse 0x0000xxxx oder RAM 0x1000xxxx,
    // z. B. `blx r3` mit r3=0x00004e4d). Solche Flash-Code-Pointer werden vom
    // hex_patcher BEWUSST nicht statisch reloziert, sondern lazy beim ersten
    // Sprung per MemManage-IACCVIOL umgebogen (handle_memfault_c). Tut der Gast
    // den Sprung aber innerhalb einer kritischen Sektion (PRIMASK=1, das
    // `__disable_irq()`-Idiom), ist die MemManage-Prioritaet maskiert -> die
    // Exception kann nicht feuern und eskaliert zu HardFault (HFSR.FORCED=1,
    // CFSR=0). Wir relocaten den PC hier identisch zum MemManage-Handler, dann
    // laeuft der Gast transparent weiter. PRIMASK bleibt unberuehrt (nicht
    // Teil des Exception-Frames). Beobachtet bei bim112/BCU2; FT12 und der
    // Bootloader rufen Flash-Pointer nie unter PRIMASK.
    {
        uint32_t fpc = exc_frame[6];
        if (fpc < emulator::LPC_LOAD_MAX_SIZE) {
            exc_frame[6] = emulator::load_base() + fpc;
            SCB->HFSR = SCB->HFSR;           // FORCED w1c
            ++faultsys::g_stats.mem_traps;
            return;
        }
        if (fpc >= 0x1000'0000u &&
            fpc <  0x1000'0000u + emulator::LPC_GUEST_RAM_SIZE) {
            exc_frame[6] = emulator::guest_ram_base() + (fpc - 0x1000'0000u);
            SCB->HFSR = SCB->HFSR;
            ++faultsys::g_stats.mem_traps;
            return;
        }
    }

    if (config::wfi_pin_wakeup() && (SCB->HFSR & SCB_HFSR_FORCED_Msk)) {
        uint32_t pc = exc_frame[6];
        const uint16_t* ip = reinterpret_cast<const uint16_t*>(pc & ~1u);
        if (*ip == 0xDF00) {                 // SVC #0 (gepatchtes WFI)
            for (;;) {
                peripherals::sample_pin_interrupts();
                peripherals::poll_timed_sources();
                if (vnvic::irq_pending()) {
                    SCB->ICSR = SCB_ICSR_PENDSVSET_Msk;
                    break;
                }
                busy_wait_us(50);
            }
            exc_frame[6] = (pc & ~1u) + 2u;  // hinter das WFI/SVC zurück
            SCB->HFSR = SCB->HFSR;           // FORCED w1c
            ++faultsys::g_stats.mem_traps;
            return;
        }
    }

    // Eskalierter Daten-/MMIO-Zugriff: Greift der Gast unter PRIMASK (kritische
    // Sektion, __disable_irq) auf emulierte LPC-MMIO/RAM/Flash oder die IAP-ROM
    // (0x1FFF1FF1) zu, ist die MemManage/BusFault-Prioritaet maskiert und der
    // Trap eskaliert zu HardFault (HFSR.FORCED). Der PC zeigt hier auf gueltigen
    // relozierten Code (rohe Code-Fetch-Spruenge wurden oben bereits umgebogen),
    // daher kann der volle Memory-Fault-Emulator die Instruktion am PC
    // dekodieren und den Zugriff bedienen — unabhaengig von CFSR/BFAR, die bei
    // einer Eskalation NICHT gelatcht werden (decode_mem_access rechnet die
    // Effektivadresse aus Instruktion + Registern). Echte, nicht dekodierbare
    // Faults degradieren in handle_memfault_c sauber zu Diagnose + Halt.
    if (SCB->HFSR & SCB_HFSR_FORCED_Msk) {
        SCB->HFSR = SCB->HFSR;               // FORCED w1c
        handle_memfault_c(
            reinterpret_cast<trap_decoder::StackedFrame*>(exc_frame), r4_r11);
        return;
    }

    print_exc_diag("HardFault", exc_frame, r4_r11);
    enter_fatal_halt();
}

extern "C" __attribute__((naked)) void isr_hardfault() {
    __asm volatile (
        "tst   lr, #4              \n"
        "ite   eq                  \n"
        "mrseq r0, msp             \n"
        "mrsne r0, psp             \n"
        "push  {r4-r11, lr}        \n"
        "sub   sp, #4              \n"   // 8-Byte-Alignment
        "add   r1, sp, #4          \n"   // r1 = &{r4..r11, lr_excret}
        "bl    hardfault_c         \n"
        "add   sp, #4              \n"
        "pop   {r4-r11, lr}        \n"
        "bx    lr                  \n"
    );
}

